app/controllers/reports_controller.rb

  def index
    @reports = Report.all
    @report = Report.new
    @periods = Period.all # bfh: to support matching periods with reports
    @rprocs = Rproc.all # bfh: to support matching reports with report procedures
---
SELECT "reports".* FROM "reports"
SELECT "periods".* FROM "periods"
SELECT "rprocs".* FROM "rprocs"

  def show
    logger.debug "*** in the show controller..."
    @report = Report.find(params[:id])
    @rprocs = Rproc.all # bfh: to support matching reports with report procedures
    @periods = Period.all # bfh: to support matching periods with reports

    respond_to do |format|
      format.html # show.html.erb
      format.json { render json: @report }
    end

    @report.update_attribute(:updated_at, Time.now)
---
SELECT "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "rprocs".* FROM "rprocs"
SELECT "periods".* FROM "periods"
UPDATE "reports" SET "updated_at" = '2014-10-04 18:22:54.039743' WHERE "reports"."id" = 2

  def create
    @report = Report.new(params[:report])
    @periods = Period.all # bfh: to support matching periods with reports
    @rprocs = Rproc.all # bfh: to support matching reports with report procedures

    flash[:report_format] = params[:report_format]

    respond_to do |format|
      if @report.save
---
SELECT "periods".* FROM "periods"
SELECT "rprocs".* FROM "rprocs"
INSERT INTO "reports" ("created_at", "module_name", "period", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 03 Oct 2014 06:11:11 UTC +00:00], ["module_name", "VoterActionReport"], ["period", "Gavin Test Period"], ["updated_at", Fri, 03 Oct 2014 06:11:11 UTC +00:00]]

  def getFormats
      @rproc_data = Rproc.where(module_name: params[:mn]).first
---
SELECT "rprocs".* FROM "rprocs" WHERE "rprocs"."module_name" = 'VoterActionReport' LIMIT 1