app/views/reports/index.html.erb

SELECT "rprocs".* FROM "rprocs" WHERE "rprocs"."module_name" = 'VoterActionReport' LIMIT 1
---
   base_path += '?'
   rproc = Rproc.where(module_name: report.module_name).first